"""
1.	Создать класс TrafficLight (светофор).

●	определить у него один атрибут color (цвет) и метод running (запуск);
●	атрибут реализовать как приватный;
●	в рамках метода реализовать переключение светофора в режимы: красный, жёлтый, зелёный;
●	продолжительность первого состояния (красный) составляет 7 секунд, второго (жёлтый) — 2 секунды, третьего (зелёный)
 — на ваше усмотрение;
●	переключение между режимами должно осуществляться только в указанном порядке (красный, жёлтый, зелёный);
●	проверить работу примера, создав экземпляр и вызвав описанный метод.

Задачу можно усложнить, реализовав проверку порядка режимов. При его нарушении выводить соответствующее сообщение
и завершать скрипт.

"""
import time

class TrafficLight:
    __color = str

    def running(self):

        print(f'\rКрасный свет')
        time.sleep(7)
        print(f'\rЖелтый свет')
        time.sleep(2)
        print(f'\rЗеленый свет')
        time.sleep(2)
        print(f'\r     ')

a = TrafficLight()
a.running()